###################################################################

# Created by write_sdc on Mon Mar 18 20:28:03 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
create_clock [get_ports pclk_i]  -period 20  -waveform {0 10}
set_clock_transition -max -rise 0.15 [get_clocks pclk_i]
set_clock_transition -max -fall 0.15 [get_clocks pclk_i]
set_input_delay -clock pclk_i  -max 3  [get_ports pclk_i]
set_input_delay -clock pclk_i  -max 3  [get_ports prstn_i]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[31]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[30]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[29]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[28]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[27]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[26]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[25]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[24]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[23]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[22]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[21]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[20]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[19]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[18]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[17]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[16]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[15]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[14]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[13]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[12]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[11]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[10]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[9]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[8]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[7]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[6]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[5]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[4]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[3]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[2]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[1]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {paddr_i[0]}]
set_input_delay -clock pclk_i  -max 3  [get_ports pwrite_i]
set_input_delay -clock pclk_i  -max 3  [get_ports psel_i]
set_input_delay -clock pclk_i  -max 3  [get_ports penable_i]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[31]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[30]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[29]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[28]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[27]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[26]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[25]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[24]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[23]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[22]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[21]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[20]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[19]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[18]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[17]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[16]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[15]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[14]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[13]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[12]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[11]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[10]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[9]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[8]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[7]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[6]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[5]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[4]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[3]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[2]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[1]}]
set_input_delay -clock pclk_i  -max 3  [get_ports {pwdata_i[0]}]
set_input_delay -clock pclk_i  -max 3  [get_ports miso]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[31]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[30]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[29]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[28]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[27]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[26]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[25]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[24]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[23]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[22]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[21]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[20]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[19]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[18]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[17]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[16]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[15]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[14]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[13]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[12]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[11]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[10]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[9]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[8]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[7]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[6]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[5]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[4]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[3]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[2]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[1]}]
set_output_delay -clock pclk_i  -max 3  [get_ports {prdata_o[0]}]
set_output_delay -clock pclk_i  -max 3  [get_ports pready_o]
set_output_delay -clock pclk_i  -max 3  [get_ports sck]
set_output_delay -clock pclk_i  -max 3  [get_ports mosi]
set_output_delay -clock pclk_i  -max 3  [get_ports nss]
set_clock_latency -max 0.7  [get_ports pclk_i]
set_clock_uncertainty -setup 0.15  [get_ports pclk_i]
